In [73]:
import numpy as np
import pandas as pd

# [Here's a full tutorial with examples on merging dataframes](https://youtu.be/TPivN7tpdwc?si=tnusr9AHvqk80lMD)

In [74]:
df1 = pd.DataFrame({
    'FellowshipID': [1001, 1002, 1003, 1004],
    'FirstName': ['Frodo', 'Samwise', 'Gandalf', 'Pippin'],
    'Skills': ['Hiding', 'Gardening', 'Spells', 'Fireworks']
})
df1

   FellowshipID FirstName     Skills
0          1001     Frodo     Hiding
1          1002   Samwise  Gardening
2          1003   Gandalf     Spells
3          1004    Pippin  Fireworks

In [75]:
df2 = pd.DataFrame({
    'FellowshipID': [1001, 1002, 1006, 1007, 1008],
    'FirstName': ['Frodo', 'Samwise', 'Legolas', 'Elrond', 'Barromir'],
    'Age': [50, 39, 2931, 6520, 51]
})
df2

   FellowshipID FirstName   Age
0          1001     Frodo    50
1          1002   Samwise    39
2          1006   Legolas  2931
3          1007    Elrond  6520
4          1008  Barromir    51

In [76]:
# df1 considered as left df, df2 considered as right df
# and default is inner join  -> intersection

# Here's the explanation what happen -> https://youtu.be/TPivN7tpdwc?si=rlSf-a6c9-8cXN1A&t=197
"""now when we not specify columns (like which columns you look for `left` and `right` df for matching, or `on` value) it by default takes common columns of both dataframes,
and match those, and the columns which it takes for match, in the resultant df it comes only 1 time, instead of both dataframes """

# by default `how` param is inner
df1.merge(df2)

   FellowshipID FirstName     Skills  Age
0          1001     Frodo     Hiding   50
1          1002   Samwise  Gardening   39

In [77]:
# so now FellowshipID, only requires to be matched

# Here's the explanation what happen -> https://youtu.be/TPivN7tpdwc?si=_9ZGRHJCFWzZSdP_&t=317
# you can give custom suffices for duplicate column names, by default column_name_for_df1_x and column_name_for_df2_y 
df1.merge(df2,on='FellowshipID',suffixes=('_x1','_y1')) 
# we can also pass list for `on` parameter

   FellowshipID FirstName_x1     Skills FirstName_y1  Age
0          1001        Frodo     Hiding        Frodo   50
1          1002      Samwise  Gardening      Samwise   39

In [78]:
# Outer join ->  https://youtu.be/TPivN7tpdwc?si=P4rl2uy7BuJtoG4J&t=477
# gives us both common and non common rows also

df1.merge(df2, how='outer')

   FellowshipID FirstName     Skills     Age
0          1001     Frodo     Hiding    50.0
1          1002   Samwise  Gardening    39.0
2          1003   Gandalf     Spells     NaN
3          1004    Pippin  Fireworks     NaN
4          1006   Legolas        NaN  2931.0
5          1007    Elrond        NaN  6520.0
6          1008  Barromir        NaN    51.0

In [ ]:
# see about indicator param of merge  -> https://youtu.be/h4hOPGo4UVU?si=e9WOjXZfrRhk6zAs&t=307
# it helpful in outer join, where we want to know where particular row comes from,

# see `_merge` column
df1.merge(df2,how='outer', indicator=True)

   FellowshipID FirstName     Skills     Age      _merge
0          1001     Frodo     Hiding    50.0        both
1          1002   Samwise  Gardening    39.0        both
2          1003   Gandalf     Spells     NaN   left_only
3          1004    Pippin  Fireworks     NaN   left_only
4          1006   Legolas        NaN  2931.0  right_only
5          1007    Elrond        NaN  6520.0  right_only
6          1008  Barromir        NaN    51.0  right_only

In [79]:
# Left join -> https://youtu.be/TPivN7tpdwc?si=rnU8R-6VdTF-WyT3&t=577

# it gonna takes every row from left df and put it in resultant df, no matter its common columns match or not(here FellowshipID, FirstName) in right df
# but Note: rows in df1 who not match with rows in df2 will get NaN value for columns of df2(the columns which are only in df2)
df1.merge(df2, how='left')

   FellowshipID FirstName     Skills   Age
0          1001     Frodo     Hiding  50.0
1          1002   Samwise  Gardening  39.0
2          1003   Gandalf     Spells   NaN
3          1004    Pippin  Fireworks   NaN

In [80]:
# Right join ->  https://youtu.be/TPivN7tpdwc?si=JMOm2XGsvmqnqHBb&t=647

# exact opposite of left join , it same thing if you do this also: df2.merge(df1, how='left')

# but Note: rows in df2 who not match with rows in df1 will get NaN value for columns of df1(the columns which are only in df1)
df1.merge(df2, how='right')

   FellowshipID FirstName     Skills   Age
0          1001     Frodo     Hiding    50
1          1002   Samwise  Gardening    39
2          1006   Legolas        NaN  2931
3          1007    Elrond        NaN  6520
4          1008  Barromir        NaN    51

In [ ]:
# cross join -> https://youtu.be/mYLdA7_EAf4?si=zLl_q8LAPwipqxMl&t=447
# while using cross merge, `left_on`, `right_on` params can not be pass to merge

# so in cross join whatever the values(rows) in left dataframe connected with values(rows) in right dataframe
# so again, what it does is : it takes one by one every row of left df, and connect each row with every row of right df, so here common like thing not exist for merging
df1.merge(df2, how='cross')

    FellowshipID_x FirstName_x     Skills  FellowshipID_y FirstName_y   Age
0             1001       Frodo     Hiding            1001       Frodo    50
1             1001       Frodo     Hiding            1002     Samwise    39
2             1001       Frodo     Hiding            1006     Legolas  2931
3             1001       Frodo     Hiding            1007      Elrond  6520
4             1001       Frodo     Hiding            1008    Barromir    51
5             1002     Samwise  Gardening            1001       Frodo    50
6             1002     Samwise  Gardening            1002     Samwise    39
7             1002     Samwise  Gardening            1006     Legolas  2931
8             1002     Samwise  Gardening            1007      Elrond  6520
9             1002     Samwise  Gardening            1008    Barromir    51
10            1003     Gandalf     Spells            1001       Frodo    50
11            1003     Gandalf     Spells            1002     Samwise    39
12            1003     Gandalf     Spells            1006     Legolas  2931
13            1003     Gandalf     Spells            1007      Elrond  6520
14            1003     Gandalf     Spells            1008    Barromir    51
15            1004      Pippin  Fireworks            1001       Frodo    50
16            1004      Pippin  Fireworks            1002     Samwise    39
17            1004      Pippin  Fireworks            1006     Legolas  2931
18            1004      Pippin  Fireworks            1007      Elrond  6520
19            1004      Pippin  Fireworks            1008    Barromir    51

In [82]:
# but we have 1 more thing also we can do (`left_on` and `right_on` params) :
df3 = pd.DataFrame({
    'ID': [1001, 1002, 1006, 1007, 1008],
    'FirstName': ['Frodo', 'Samwise', 'Legolas', 'Elrond', 'Barromir'],
    'Age': [50, 39, 2931, 6520, 51]
})

df1,df3

(   FellowshipID FirstName     Skills
 0          1001     Frodo     Hiding
 1          1002   Samwise  Gardening
 2          1003   Gandalf     Spells
 3          1004    Pippin  Fireworks,
      ID FirstName   Age
 0  1001     Frodo    50
 1  1002   Samwise    39
 2  1006   Legolas  2931
 3  1007    Elrond  6520
 4  1008  Barromir    51)

In [83]:
# Now, first see the problem that here we can see:
# - we wanna join df1,df3
# - but the problem is the column names(the columns that we want to join on) are not same, df1 has column name `FellowshipID` and df3 has column name `ID`
# - but we know that FellowshipID is same as ID, and basically we want to join dfs on those, here's how we can

""" now see what pandas does here is: it takes `FellowshipID` from df1 and `ID` from df3, and when it sees `FellowshipID` for each row in df1, it will see `ID` 
in df3, it will match in `ID` column, if those columns value match for that particular row, then it will connect those rows, otherwise not""" 
df1.merge(df3, left_on='FellowshipID', right_on='ID')

   FellowshipID FirstName_x     Skills    ID FirstName_y  Age
0          1001       Frodo     Hiding  1001       Frodo   50
1          1002     Samwise  Gardening  1002     Samwise   39

In [ ]:
# so what index params does is: it takes index of df1 and df2 and connects them on axis=1
df1.merge(df2, left_index=True, right_index=True)

   FellowshipID_x FirstName_x     Skills  FellowshipID_y FirstName_y   Age
0            1001       Frodo     Hiding            1001       Frodo    50
1            1002     Samwise  Gardening            1002     Samwise    39
2            1003     Gandalf     Spells            1006     Legolas  2931
3            1004      Pippin  Fireworks            1007      Elrond  6520

# Join method

In [ ]:
# join method used to merge dfs based on indexes
df1,df2

(   FellowshipID FirstName     Skills
 0          1001     Frodo     Hiding
 1          1002   Samwise  Gardening
 2          1003   Gandalf     Spells
 3          1004    Pippin  Fireworks,
    FellowshipID FirstName   Age
 0          1001     Frodo    50
 1          1002   Samwise    39
 2          1006   Legolas  2931
 3          1007    Elrond  6520
 4          1008  Barromir    51)

In [104]:
df1.set_index('FellowshipID').join(df2.set_index('FellowshipID'), lsuffix='_left', rsuffix='_right',how='inner')

             FirstName_left     Skills FirstName_right  Age
FellowshipID
1001                  Frodo     Hiding           Frodo   50
1002                Samwise  Gardening         Samwise   39

In [106]:
df1.set_index('FellowshipID').join(df2.set_index('FellowshipID'), lsuffix='_left', rsuffix='_right',how='right')

             FirstName_left     Skills FirstName_right   Age
FellowshipID
1001                  Frodo     Hiding           Frodo    50
1002                Samwise  Gardening         Samwise    39
1006                    NaN        NaN         Legolas  2931
1007                    NaN        NaN          Elrond  6520
1008                    NaN        NaN        Barromir    51

In [88]:
# concat -> https://youtu.be/TPivN7tpdwc?si=IXcOejL74WH3y2Ln&t=1087

# it gonna takes fist df and will put it on top of another df, you can change axis, but by default axis=0, that's why it kind of stack on top of each other
pd.concat([df1,df2])

   FellowshipID FirstName     Skills     Age
0          1001     Frodo     Hiding     NaN
1          1002   Samwise  Gardening     NaN
2          1003   Gandalf     Spells     NaN
3          1004    Pippin  Fireworks     NaN
0          1001     Frodo        NaN    50.0
1          1002   Samwise        NaN    39.0
2          1006   Legolas        NaN  2931.0
3          1007    Elrond        NaN  6520.0
4          1008  Barromir        NaN    51.0

In [89]:
pd.concat([df1,df2], axis=1)

   FellowshipID FirstName     Skills  FellowshipID FirstName   Age
0        1001.0     Frodo     Hiding          1001     Frodo    50
1        1002.0   Samwise  Gardening          1002   Samwise    39
2        1003.0   Gandalf     Spells          1006   Legolas  2931
3        1004.0    Pippin  Fireworks          1007    Elrond  6520
4           NaN       NaN        NaN          1008  Barromir    51

In [ ]:
# `join` param -> https://youtu.be/TPivN7tpdwc?si=eoX9Kpiol7ykTzWF&t=1177

""" 
by default it's outer, basically what `join` param does, that we can specify inner, and then it will take those columns only that common in both dataframes in resultant df
"""

# `ignore_index`, to ignore original index, and give new indexes 
pd.concat([df1,df2], join='inner')

   FellowshipID FirstName
0          1001     Frodo
1          1002   Samwise
2          1003   Gandalf
3          1004    Pippin
0          1001     Frodo
1          1002   Samwise
2          1006   Legolas
3          1007    Elrond
4          1008  Barromir